/**
 * ban.setting.js
 * 設定関係、ロジックを含まないのリテラルデータ
 */
// 駒の画像の設定
ban.komaImg = {

  //通常駒
  "歩" : ["fuhyou1.png","fuhyou2.png"],
  "飛" : ["hisya1.png","hisya2.png"],
  "角" : ["kakugyou1.png","kakugyou2.png"],
  "香" : ["kyousya1.png","kyousya2.png"],
  "桂" : ["keima1.png","keima2.png"],
  "銀" : ["ginsyou1.png","ginsyou2.png"],
  "金" : ["kinsyou1.png","kinsyou2.png"],
  "王" : ["king1.png","king2.png"],

  //成金駒
  "竜" : ["ryuuou1.png","ryuuou2.png"],
  "馬" : ["ryuma1.png","ryuma2.png"],
  "と" : ["tokin1.png","tokin2.png"],
  "成銀" : ["narigin1-2.png","narigin2-2.png"],
  "圭" : ["narikei1-2.png","narikei2-2.png"],
  "杏" : ["narikyou1-2.png","narikyou2-2.png"]

};

//駒が移動できる範囲
ban.komaMovableZone =  {
  "王" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,0],
    [1,-1],
    [0,-1],
    [-1,-1],
    [-1,0]
  ],
  "飛" : [
    [-1,0],
    [0,1],
    [1,0],
    [0,-1]
  ],
  "角" : [
    [-1,1],
    [1,1],
    [1,-1],
    [-1,-1]
  ],
  "金" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,0],
    [0,-1],
    [-1,0]
  ],
  "銀" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,-1],
    [-1,-1]
  ],
  "桂" : [
    [-1,2],
    [1,2]
  ],
  "香" : [
    [0,1],
    [0,2],
    [0,3],
    [0,4],
    [0,5],
    [0,6],
    [0,7],
    [0,8]
  ],
  "歩" : [
    [0,1]
  ],
  "竜" : [
    [-1,0],
    [0,1],
    [1,0],
    [0,-1],
    [1,1],
    [1,-1],
    [-1,-1],
    [-1,1]
  ],
  "馬" : [
    [-1,1],
    [1,1],
    [1,-1],
    [-1,-1],
    [-1,0],
    [0,1],
    [1,0],
    [0,-1]
  ],
  "圭" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,0],
    [0,-1],
    [-1,0]
  ],
  "杏" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,0],
    [0,-1],
    [-1,0]
  ],
  "と" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,0],
    [0,-1],
    [-1,0]
  ],
  "成銀" : [
    [-1,1],
    [0,1],
    [1,1],
    [1,0],
    [0,-1],
    [-1,0]
  ]
};